fideleka/scummvm-lilka/backends/platform/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_ETH_USE_SPI_ETHERNET is not set
CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME=y
# Octal PSRAM on T-Deck v1 (8 MB).
# Do NOT copy instructions/rodata into PSRAM: the ScummVM binary is ~7 MB
# and copying it would leave <1 MB of PSRAM for the runtime heap, which
# then fragments and causes theme-engine allocations to fail. Keep code
# and rodata in flash (read via the cache) and use PSRAM purely as a
# heap pool.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
# CONFIG_SPIRAM_MEMTEST is not set
# Let plain malloc() put anything >=64 bytes into PSRAM. ScummVM's theme
# engine allocates ~150 KB surfaces via calloc; with the defaults it
# tries internal RAM first and fails. Keep a small 16 KB internal
# reserve for DMA/interrupt paths.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=64
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_TASK_WDT_EN is not set
CONFIG_ESP_PANIC_HANDLER_IRAM=y
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_USE_FASTSEEK=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_IP4_REASSEMBLY=y
CONFIG_LWIP_IP6_REASSEMBLY=y
CONFIG_LWIP_IP_REASS_MAX_PBUFS=30
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
